app/views/statuses/index.html.erb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 6 ORDER BY "statuses"."id" DESC LIMIT 1
---

<%= @user.statuses.last.message %>