app/views/users/edit.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---

  -if User.find(session[:id]).admin == 1