app/views/private_messages/index.html.haml

			%tr
				%td= User.find(private_message.from).username
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]