app/controllers/log_in_controller.rb

  def index
    @Users = User.all
---
SELECT "users".* FROM "users"