app/controllers/password_recovery_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @user = User.find(id) # look up movie by unique ID
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @Users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.where(params[:user]).first
    if @user
      api = GoogleVoice::Api.new('project.conman@gmail.com','Raging_Flamingos')
      newpass = User.randompass
      message = "Project ConMan. PLEASE DON'T REPLY THIS SMS. Your password is " + newpass
      @user.password = User.encrypt(newpass)
      @user.save
---
UPDATE "users" SET "password" = 'j4xIHzp', "updated_at" = '2012-11-10 21:22:32.260392' WHERE "users"."id" = 3