app/controllers/private_messages_controller.rb

	def index
		@pm = PrivateMessage.all
---
SELECT "private_messages".* FROM "private_messages"

	def create
		@user = User.where("username = '#{params[:private_message][:user]}'").first
---
SELECT "users".* FROM "users" WHERE (username = 'test') LIMIT 1