app/controllers/profiles_controller.rb

SELECT user_id, first_name, last_name, username, email, phone FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "6"]]
---
	def index
		#If we leave this as default, Rails will automatically
		#render index.html.erb
		@User = User.select("id, first_name, last_name, username, email, phone").find(params[:id])