app/controllers/searches_controller.rb

SELECT "users".* FROM "users" WHERE (first_name LIKE '%q%' OR username LIKE '%q%')
---
	def index
   		@result = User.where('first_name LIKE ? OR username LIKE ?', "%#{params[:query]}%", "%#{params[:query]}%").all