app/controllers/statuses_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
INSERT INTO "statuses" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Nov 2012 03:50:08 UTC +00:00], ["message", "test"], ["updated_at", Mon, 12 Nov 2012 03:50:08 UTC +00:00], ["user_id", 6]]
---
  def index

    @user = User.find(session[:id])
    @user.statuses.create(:message => "FK ME")