app/controllers/users_controller.rb

INSERT INTO "users" ("address", "admin", "birthday", "created_at", "email", "first_name", "last_name", "password", "phone", "show_addr", "show_birthday", "show_email", "show_fn", "show_ln", "show_phone", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
 def create
    if params[:user][:password] == params[:user][:repassword]
        @user = User.create!(:admin => params[:user][:admin], :username => params[:user][:username], :first_name => params[:user][:first_name], :last_name => params[:user][:last_name], :address => params[:user][:address], :phone => params[:user][:phone], :email => params[:user][:email], :birthday => params[:user][:birthday], :password => User.encrypt(params[:user][:password]))

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @user = User.find params[:id]

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "phone" = 13123, "updated_at" = '2012-11-09 06:13:07.242459' WHERE "users"."id" = 1
---
  def update
    @user = User.find params[:id]
    if params[:user][:password] == params[:user][:repassword]
      if params[:user][:password] == ""
        @user.update_attributes!(:admin => params[:user][:admin], :username => params[:user][:username], :first_name => params[:user][:first_name], :last_name => params[:user][:last_name], :address => params[:user][:address], :phone => params[:user][:phone], :email => params[:user][:email], :birthday => params[:user][:birthday])