app/controllers/username_recovery_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @user = User.find(id) # look up movie by unique ID
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    @Users = User.all
---
SELECT "users".* FROM "users"